loadTests/ArtilleryGetTest.yml
config:
  target: 'http://localhost:3001'
  phases:
    # - duration: 60
    #   arrivalCount: 60
    #   name: "1 rps"
    # - duration: 60
    #   arrivalCount: 600
    #   name: "10 rps"
    # - duration: 60
    #   arrivalCount: 6000
    #   name: "100 rps"
    - duration: 60
      arrivalCount: 60000
      name: "1000 rps"

scenarios:
  - flow:
    - get:
        url: "/overview/{{$randomNumber(9000000,10000000)}}"