loadTests/ArtilleryGetTest.yml
config:
  target: 'http://ec2-54-153-99-135.us-west-1.compute.amazonaws.com'
  phases: 
    - duration: 60
      arrivalRate: 1
      # arrivalCount: 60
      name: "1 rps"
    # - duration: 60
    #   arrivalCount: 600
    #   name: "10 rps"
    # - duration: 60
    #   arrivalCount: 6000
    #   name: "100 rps"
    # - duration: 60
    #   arrivalCount: 60000
    #   name: "1000 rps"

scenarios:
  - flow:
    - get:
        url: "/api/overview/:{{$randomNumber(9000000,10000000)}}"